## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 3 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                NAME                                 |
|----------|---------------------------------------------------------------------|
| update   | `aws_alb_listener_rule.forms_api[0]`                                |
|          | `aws_s3_object.maintenance_static_page_html_files[&quot;index-fr.html&quot;]` |
|          | `aws_s3_object.maintenance_static_page_html_files[&quot;index.html&quot;]`    |
| recreate | `aws_lb_target_group.forms_api[0]`                                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_alb_listener_rule.forms_api[0] will be updated in-place
  ~ resource "aws_alb_listener_rule" "forms_api" {
        id           = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:listener-rule/app/form-viewer/5e6bc2d9ab810b68/028e8eeeed9c3a34/da5e1d035d4991ce"
        tags         = {}
        # (4 unchanged attributes hidden)

      ~ action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:targetgroup/form-api/bb1e4c676d21e4a0" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group.forms_api[0] must be replaced
-/+ resource "aws_lb_target_group" "forms_api" {
      ~ arn                                = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:targetgroup/form-api/bb1e4c676d21e4a0" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/form-api/bb1e4c676d21e4a0" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:targetgroup/form-api/bb1e4c676d21e4a0" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:ca-central-1:687401027353:loadbalancer/app/form-viewer/5e6bc2d9ab810b68",
        ] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
      ~ name                               = "form-api" -> "forms-api" # forces replacement
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      ~ tags                               = {
          ~ "Name" = "form_api" -> "forms_api"
        }
      ~ tags_all                           = {
          ~ "Name"       = "form_api" -> "forms_api"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

      ~ stickiness {
          + arn                                = (known after apply)
          + arn_suffix                         = (known after apply)
          + connection_termination             = (known after apply)
          + deregistration_delay               = (known after apply)
          + id                                 = (known after apply)
          + ip_address_type                    = (known after apply)
          + lambda_multi_value_headers_enabled = (known after apply)
          + load_balancer_arns                 = (known after apply)
          + load_balancing_algorithm_type      = (known after apply)
          + load_balancing_anomaly_mitigation  = (known after apply)
          + load_balancing_cross_zone_enabled  = (known after apply)
          + name                               = (known after apply)
          + name_prefix                        = (known after apply)
          + port                               = (known after apply)
          + preserve_client_ip                 = (known after apply)
          + protocol                           = (known after apply)
          + protocol_version                   = (known after apply)
          + proxy_protocol_v2                  = (known after apply)
          + slow_start                         = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + target_type                        = (known after apply)
          + vpc_id                             = (known after apply)
        } -> (known after apply)

      ~ target_failover {
          + arn                                = (known after apply)
          + arn_suffix                         = (known after apply)
          + connection_termination             = (known after apply)
          + deregistration_delay               = (known after apply)
          + id                                 = (known after apply)
          + ip_address_type                    = (known after apply)
          + lambda_multi_value_headers_enabled = (known after apply)
          + load_balancer_arns                 = (known after apply)
          + load_balancing_algorithm_type      = (known after apply)
          + load_balancing_anomaly_mitigation  = (known after apply)
          + load_balancing_cross_zone_enabled  = (known after apply)
          + name                               = (known after apply)
          + name_prefix                        = (known after apply)
          + port                               = (known after apply)
          + preserve_client_ip                 = (known after apply)
          + protocol                           = (known after apply)
          + protocol_version                   = (known after apply)
          + proxy_protocol_v2                  = (known after apply)
          + slow_start                         = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + target_type                        = (known after apply)
          + vpc_id                             = (known after apply)
        } -> (known after apply)

      ~ target_group_health {
          + arn                                = (known after apply)
          + arn_suffix                         = (known after apply)
          + connection_termination             = (known after apply)
          + deregistration_delay               = (known after apply)
          + id                                 = (known after apply)
          + ip_address_type                    = (known after apply)
          + lambda_multi_value_headers_enabled = (known after apply)
          + load_balancer_arns                 = (known after apply)
          + load_balancing_algorithm_type      = (known after apply)
          + load_balancing_anomaly_mitigation  = (known after apply)
          + load_balancing_cross_zone_enabled  = (known after apply)
          + name                               = (known after apply)
          + name_prefix                        = (known after apply)
          + port                               = (known after apply)
          + preserve_client_ip                 = (known after apply)
          + protocol                           = (known after apply)
          + protocol_version                   = (known after apply)
          + proxy_protocol_v2                  = (known after apply)
          + slow_start                         = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + target_type                        = (known after apply)
          + vpc_id                             = (known after apply)
        } -> (known after apply)

      ~ target_health_state {
          + arn                                = (known after apply)
          + arn_suffix                         = (known after apply)
          + connection_termination             = (known after apply)
          + deregistration_delay               = (known after apply)
          + id                                 = (known after apply)
          + ip_address_type                    = (known after apply)
          + lambda_multi_value_headers_enabled = (known after apply)
          + load_balancer_arns                 = (known after apply)
          + load_balancing_algorithm_type      = (known after apply)
          + load_balancing_anomaly_mitigation  = (known after apply)
          + load_balancing_cross_zone_enabled  = (known after apply)
          + name                               = (known after apply)
          + name_prefix                        = (known after apply)
          + port                               = (known after apply)
          + preserve_client_ip                 = (known after apply)
          + protocol                           = (known after apply)
          + protocol_version                   = (known after apply)
          + proxy_protocol_v2                  = (known after apply)
          + slow_start                         = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + target_type                        = (known after apply)
          + vpc_id                             = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.maintenance_static_page_html_files["index-fr.html"] will be updated in-place
  ~ resource "aws_s3_object" "maintenance_static_page_html_files" {
      ~ etag                          = "5c195ef016b9e898437a543aba2301ac" -> "3be80c8fc3bbd8a51bbc9709fb555120"
        id                            = "index-fr.html"
        tags                          = {}
      + version_id                    = (known after apply)
        # (23 unchanged attributes hidden)
    }

  # aws_s3_object.maintenance_static_page_html_files["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "maintenance_static_page_html_files" {
      ~ etag                          = "f15e6aa2fd75c9b6b97d93d2b1fedfbd" -> "83f45f59fb216b42e901683edd2f7529"
        id                            = "index.html"
        tags                          = {}
      + version_id                    = (known after apply)
        # (23 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  ~ lb_target_group_api_arn        = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:targetgroup/form-api/bb1e4c676d21e4a0" -> (known after apply)
  ~ lb_target_group_api_arn_suffix = "targetgroup/form-api/bb1e4c676d21e4a0" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.form_viewer"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.form_viewer_maintenance_mode"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.forms_api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.forms_api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudfront_distribution.maintenance_mode"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.firehose_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.form_viewer"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.form_viewer_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.form_viewer_https"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.form_viewer_1"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.form_viewer_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.forms_api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.maintenance_mode"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_css_files[\"style.css\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_html_files[\"index-fr.html\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_html_files[\"index.html\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_ico_files[\"favicon.ico\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_svg_files[\"site-unavailable.svg\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.alb"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.route53_hosted_zone[0]"]
WARN - plan.json - main -...
```

</details>
